УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПоискЗакупок/КонтурЗакупки_ПоискЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_ПоискЗакупок</name>
  <attributes>
    <name>Авансирование223</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Авансирование44</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗакупкиБезНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленныеИсключенныеЗаказчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписейВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписейНаСтраницу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаемыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяЦенаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоДокументам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреимуществаСМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораВсе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораДругиеСпособы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗакупкаУЕдинственногоПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросИлиМониторингЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЗапросКотировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораКонкурс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбораЭлектронныйАукцион</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраницВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов223ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов44ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоргов615ПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческиеИМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочныйПоиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЗавершены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапОтменены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПланируются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодачаЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапРаботаКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапТолькоНесостоявшиеся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПоиска</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ШаблоныПоиска</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДоТекущейДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРегламентномЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьЗагрузкуЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговКоммерческие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТорговМалые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаОффлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаОффлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПоискаОффлайн</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ШаблоныПоиска</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакупкиНаЗагрузку</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отрасли</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_Отрасли</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтраслиОбновленные</name>
    <attributes>
      <name>Отрасль</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_ОтраслиОбновленные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Площадки</name>
    <attributes>
      <name>Площадка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПлощадки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регионы</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРегиона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПоиска</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗакупкиНаЭТП</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтбора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗакупки</name>
      <type>
        <types>EnumRef.КонтурЗакупки_ТипыЗакупки</types>
      </type>
    </attributes>
    <attributes>
      <name>НМЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаЭТП</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаКЗ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПодачиЗаявок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаОтменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПубликации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеЗакупки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаЗагруженный</name>
      <type>
        <types>DocumentRef.КонтурЗакупки_Закупка</types>
      </type>
    </attributes>
    <attributes>
      <name>ИННЗаказчиковИОрганизаторов</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МестаПоставки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сниппеты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СниппетыДляОтображения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Участники</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодведенияИтогов</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаНеСостоялась</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупкаПланируется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчастникиКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сниппеты</name>
    <attributes>
      <name>ИдентификаторЗакупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сниппет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПоискЗакупок/Forms/ФормаВыбораЗаказчиков/Module.bsl
&НаКлиенте
Перем гНаименованиеСправочникаКонтрагенты; // Строка     

&НаКлиенте
Перем гСоответствиеПолейСправочникаКонтрагенты; // Строка     

#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтраницаТекущая = 1;
	Если Параметры.Свойство("ЗаказчикиВыбранные") Тогда
		Для Каждого ЗаказчикВыбран Из Параметры["ЗаказчикиВыбранные"] Цикл
			НовСтр = ЗаказчикиВыбранные.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ЗаказчикВыбран);
			НовСтр.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");
		КонецЦикла;
	КонецЕсли;
	Если Параметры.Свойство("ЗаказчикиВРежимеИсключения") Тогда
		ЗаказчикиВРежимеИсключения = Параметры["ЗаказчикиВРежимеИсключения"];
	КонецЕсли;
КонецПроцедуры      

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаТекущаяПриИзменении(Элемент)
	СтраницаТекущая = Мин(Макс(СтраницаТекущая, 1), СтраницВсего);
	НайтиЗаказчиковНаКлиенте(ПодборЗаказчика, СтраницаТекущая);
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаказчикаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
	СтандартнаяОбработка)
	НайтиЗаказчиковНаКлиенте(Текст);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказчикиВыбранные
&НаКлиенте
Процедура ЗаказчикиВыбранныеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		ПеренестиМассивЗначенийВЗаказчикиВыбранные(ПараметрыПеретаскивания.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикиВыбранныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ЗаказчикиВыбранныеДействиеСоСтрокой Тогда
		УдалитьСтрокуИзЗаказчиковВыбранных(ВыбраннаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикиВыбранныеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказчики
&НаКлиенте
Процедура ЗаказчикиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		УдалитьПоМассивуЗначенийИзЗаказчикиВыбранные(ПараметрыПеретаскивания.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПеренестиСтрокуВЗаказчикиВыбранные(ВыбраннаяСтрока);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

#Область Пангинация

&НаКлиенте
Процедура НавигацияПоСтраницамПервая(Команда)
	Если Не СтраницаТекущая = 1 Тогда
		СтраницаТекущая = 1;
		НайтиЗаказчиковНаКлиенте(ПодборЗаказчика, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамСледующая(Команда)
	Если Не СтраницаТекущая = Мин(СтраницаТекущая + 1, СтраницВсего) Тогда
		СтраницаТекущая = Мин(СтраницаТекущая + 1, СтраницВсего);
		НайтиЗаказчиковНаКлиенте(ПодборЗаказчика, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПредыдущая(Команда)
	Если Не СтраницаТекущая = Макс(СтраницаТекущая - 1, 1) Тогда
		СтраницаТекущая = Макс(СтраницаТекущая - 1, 1);
		НайтиЗаказчиковНаКлиенте(ПодборЗаказчика, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НавигацияПоСтраницамПоследняя(Команда)
	Если Не СтраницаТекущая = СтраницВсего Тогда
		СтраницаТекущая = СтраницВсего;
		НайтиЗаказчиковНаКлиенте(ПодборЗаказчика, СтраницаТекущая);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура КомандаПеренестиВВыбранные(Команда)
	ПеренестиСтрокиВЗаказчикиВыбранные();
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьИзВыбранных(Команда)
	УдалитьСтрокиИзЗаказчикиВыбранные();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменить(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавить(Команда)   
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаказчикиВыбранные", ЗаказчикиВыбранные);
	Результат.Вставить("ЗаказчикиВРежимеИсключения", ЗаказчикиВРежимеИсключения);
	
	Закрыть(Результат); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикиВыбранныеОчистить(Команда)
	ЗаказчикиВыбранные.Очистить();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НайтиЗаказчиковНаКлиенте(Название, СтраницаЗначение = 1)
	Заказчики.Очистить();

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьСписокЗаказчиков(Название, СтраницаЗначение - 1);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			СтруктураЗаказчиков = РезультатHTTPЗапроса["data"];
			ЗаписейВсего = СтруктураЗаказчиков["total"];
			Элементы.ЗаказчикиНаименование.Заголовок = СтрШаблон("Найдено заказчиков: %1", ЗаписейВсего);
			СтраницаТекущая = СтраницаЗначение;
			Если Не СтруктураЗаказчиков["organizations"] = Неопределено Тогда
				МассивЗаказчиков = СтруктураЗаказчиков["organizations"];
				Для Каждого ЭлементЗаказчик Из МассивЗаказчиков Цикл
					НовСтрокаЗаказчик = Заказчики.Добавить();
					НовСтрокаЗаказчик.Наименование = ЭлементЗаказчик["shortName"];
					НовСтрокаЗаказчик.ОГРН = ЭлементЗаказчик["ogrn"];
					НовСтрокаЗаказчик.ИНН = ЭлементЗаказчик["inn"];
					НовСтрокаЗаказчик.Адрес = ЭлементЗаказчик["address"];
				КонецЦикла;
				ЗаписейНаСтраницу = Макс(МассивЗаказчиков.Количество(), 1, ЗаписейНаСтраницу);
			КонецЕсли;
			СтраницВсего = Цел(ЗаписейВсего / ЗаписейНаСтраницу) + ?((ЗаписейВсего % ЗаписейНаСтраницу) > 0, 1, 0);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСтрокиВЗаказчикиВыбранные()
	ВыделенныеСтроки = Элементы.Заказчики.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ПеренестиСтрокуВЗаказчикиВыбранные(ВыделеннаяСтрока);
	КонецЦикла;
КонецПроцедуры         

&НаКлиенте
Процедура ЗаголовокВыбранныхЗаказчиков()                                                   
	ЗаписейВсего = ЗаказчикиВыбранные.Количество();
	Элементы.ЗаказчикиВыбранныеНаименование.Заголовок = СтрШаблон("Выбрано заказчиков: %1", ЗаписейВсего);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСтрокуВЗаказчикиВыбранные(ИдентификаторВыделеннойСтроки)
	СтрокаПоИдентификатору = Заказчики.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
	Если Не ЗаказчикЕстьВВыбранных(СтрокаПоИдентификатору) Тогда
		НовСтрока = ЗаказчикиВыбранные.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаПоИдентификатору);
		НовСтрока.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");   
		ЗаголовокВыбранныхЗаказчиков();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиМассивЗначенийВЗаказчикиВыбранные(МассивЗначений)
	Для Каждого ЭлементМассива Из МассивЗначений Цикл
		Если Не ЗаказчикЕстьВВыбранных(ЭлементМассива) Тогда
			НовСтрока = ЗаказчикиВыбранные.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ЭлементМассива);
			НовСтрока.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ЗаказчикЕстьВВыбранных(СтруктураЗаказчик)
	СтруктураПоиск = Новый Структура("ИНН", СтруктураЗаказчик.ИНН);
	ЗаказчикВВыбранных = ЗаказчикиВыбранные.НайтиСтроки(СтруктураПоиск).Количество() > 0;

	Возврат ЗаказчикВВыбранных;
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокуИзЗаказчиковВыбранных(ВыделеннаяСтрока)
	УдаляемаяСтрока = ЗаказчикиВыбранные.НайтиПоИдентификатору(ВыделеннаяСтрока);
	ЗаказчикиВыбранные.Удалить(УдаляемаяСтрока);
	ЗаголовокВыбранныхЗаказчиков();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиИзЗаказчикиВыбранные()
	ВыделенныеСтроки = Элементы.ЗаказчикиВыбранные.ВыделенныеСтроки;
	Для Инд = -ВыделенныеСтроки.ВГраница() По 0 Цикл
		УдалитьСтрокуИзЗаказчиковВыбранных(ВыделенныеСтроки[-Инд]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоМассивуЗначенийИзЗаказчикиВыбранные(МассивЗначений)
	Для Каждого ЭлементМассива Из МассивЗначений Цикл
		СтрукОтбор = Новый Структура("ИНН", ЭлементМассива.ИНН);
		НайденныеСтрокиЗаказчикиВыбранные = ЗаказчикиВыбранные.НайтиСтроки(СтрукОтбор);
		Для Каждого СтрокаНаУдаление Из НайденныеСтрокиЗаказчикиВыбранные Цикл
			ЗаказчикиВыбранные.Удалить(СтрокаНаУдаление);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти         

&НаКлиенте
Процедура ЗаказчикиДобавитьИзКонфигурации(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ИмяКонфигурации1С = КонтурЗакупки_СлужебныеВызовСервера.ИмяКонфигурации1С();
	Если ИмяКонфигурации1С = "УТ" Или ИмяКонфигурации1С = "БСП" Или ИмяКонфигурации1С = "ERP" Тогда
		ОткрытьФорму(
		"Справочник." + гНаименованиеСправочникаКонтрагенты + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму(
		"Справочник." + гНаименованиеСправочникаКонтрагенты + ".ФормаСписка", ПараметрыФормы, ЭтаФорма, , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	гНаименованиеСправочникаКонтрагенты = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"НаименованиеСправочникаКонтрагентов", "Контрагенты"); 
	
	гСоответствиеПолейСправочникаКонтрагенты = Новый Структура;
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("Наименование", "Наименование");
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("ИНН", "ИНН");
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("ОГРН", "РегистрационныйНомер");
	гСоответствиеПолейСправочникаКонтрагенты.Вставить("Адрес", "");

КонецПроцедуры

&НаКлиенте
Процедура КомандаНайти(Команда)
	НайтиЗаказчиковНаКлиенте(ПодборЗаказчика);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка." + гНаименованиеСправочникаКонтрагенты) Тогда
			ДобавитьЗаказчикаНаКлиенте(ВыбранноеЗначение);
			ЗаголовокВыбранныхЗаказчиков();
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			Для Каждого ЭлМассива Из ВыбранноеЗначение Цикл
				Если ТипЗнч(ЭлМассива) = Тип("СправочникСсылка." + гНаименованиеСправочникаКонтрагенты) Тогда
					ДобавитьЗаказчикаНаКлиенте(ЭлМассива);
				КонецЕсли;
			КонецЦикла;
			ЗаголовокВыбранныхЗаказчиков();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьЗаказчикаНаКлиенте(ВыбранноеЗначение)
	ДобавлятьЗаказчика = Истина;

	Если ДобавлятьЗаказчика Тогда
			// проверяем обязательно ИНН
		ИНН = ПолучитьИНННаСервере(ВыбранноеЗначение, гСоответствиеПолейСправочникаКонтрагенты["ИНН"]);
		Если Не ЗначениеЗаполнено(ИНН) Тогда
			ДобавлятьЗаказчика = Ложь;
			КонтурЗакупки_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(
					"ru = 'У контрагента не заполнено обязательное поле ИНН'"));
		КонецЕсли;
	КонецЕсли;

	Если ДобавлятьЗаказчика Тогда
		// Ищем в имеющихся по ИНН  
		ПоискПоИНН = Новый Структура;
		ПоискПоИНН.Вставить("ИНН", ИНН);
		Если ЗаказчикЕстьВВыбранных(ПоискПоИНН) Тогда
			ДобавлятьЗаказчика = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ДобавлятьЗаказчика Тогда
		ДобавитьЗаказчикаНаСервере(ВыбранноеЗначение, гСоответствиеПолейСправочникаКонтрагенты);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ДобавитьЗаказчикаНаСервере(ВыбранныйЗаказчик, СоответствиеПолейСправочникаКонтрагенты)
	СтрокаЗаказчик = ЗаказчикиВыбранные.Добавить();
	СтрокаЗаказчик.ДействиеСоСтрокой = НСтр("ru = 'Удалить'");
	Для Каждого ПолеСправочникеКонтрагенты Из СоответствиеПолейСправочникаКонтрагенты Цикл
		Если Не ПустаяСтрока(ПолеСправочникеКонтрагенты.Значение) Тогда
			Попытка
				СтрокаЗаказчик[ПолеСправочникеКонтрагенты.Ключ] = ВыбранныйЗаказчик[ПолеСправочникеКонтрагенты.Значение];  

			Исключение
				;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьИНННаСервере(ВыбранныйЗаказчик, ПолеИНН)
	ИНН = "";
	ИНН = ВыбранныйЗаказчик[ПолеИНН];
	Возврат ИНН
КонецФункции
